### Titanic Data_Set

In [1]:
import pandas as pd

In [4]:
df= pd.read_csv('https://raw.githubusercontent.com/Shaileshom/Data_Set/master/titanic.csv')
ab.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
type(df)                                   # to know the type

pandas.core.frame.DataFrame

In [7]:
df.dtypes                                  # to know the dtatypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
df.columns                                # to know the column names

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
df.index                                  # to know the rows

RangeIndex(start=0, stop=891, step=1)

In [12]:
df.info()                                 # to know complete info about data set

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [16]:
df[['Ticket']].head()                  # to fetch the 'Ticket column'

# try with df['Ticket'].head() too

             Ticket
0         A/5 21171
1          PC 17599
2  STON/O2. 3101282
3            113803
4            373450

In [17]:
df1= pd.read_csv('https://raw.githubusercontent.com/Shaileshom/Data_Set/master/titanic.csv', index_col=['PassengerId', 'Survived', 'Pclass'])

# creating multi-indexes(index under index)

df1.head()

,,,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,Survived,Pclass,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df2= pd.read_csv('https://raw.githubusercontent.com/Shaileshom/Data_Set/master/titanic.csv', names=['A', 'B', 'C'])

# creating own index with name of 'A', 'B', 'C'. by default it takes the first row as a index. but incase i want to creat my own indexes.

df2.head()

,,,,,,,,,A,B,C
PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S

### now here differences between
#### 1). ab1.head(5),
#### 2). ab2= pd.read_csv('titanic.csv', nrows=5)
#### 3). ab2.options.display.max_row=5 and

In [19]:
ab1=pd.read_csv('https://raw.githubusercontent.com/Shaileshom/Data_Set/master/titanic.csv')
# ab1.head(10)                                  # it will load whole data from dataset and then shows first 10 rows

ab2=pd.read_csv('https://raw.githubusercontent.com/Shaileshom/Data_Set/master/titanic.csv', nrows=5)
                                                # here it will onle load 5 rows from the dataset[not able to show 10 rows]

In [20]:
pd.options.display.max_rows=5                   # load whole data, but shows only 5 data
ab3= pd.read_csv('https://raw.githubusercontent.com/Shaileshom/Data_Set/master/titanic.csv')